[{"Program":"(Restoring the Environment and Developing Youth) READY Program","Org":"Howard County EcoWorks","City":"Columbia","State":"MD","Lat":39.1963,"Lon":-76.8522,"Overview":"READY provides summer employment to young adults ages 16 to 25. Crews build rain gardens, maintain stormwater management practices, and provide habitat management services in Howard County. ","Training.Credentials.Offered":"Chesapeake Bay Landscape Professional Associate Certification","Link":"https://www.howardecoworks.org/ready"},{"Program":"Branches to Chances","Org":"Delaware Center for Horticulture","City":"Wilmington","State":"DE","Lat":39.7594,"Lon":-75.5582,"Overview":"Branches to Chances is a horticultural job training program for unemployed, underemployed, and/or previously incarcerated individuals ages 18+. Training is aimed at connecting participants with entry-level positions in the horticulture industry, such as landscaping, tree maintenance, and park maintenance.","Training.Credentials.Offered":"Plant/weed identification and basic botany. Equipment use and safety. Financial and computer literacy. Job interview prep and workplace skills.","Link":"https://www.thedch.org/content/branches-chances"},{"Program":"DC Green Corps","Org":"Washington Parks and People","City":"Washington","State":"DC","Lat":38.9235,"Lon":-77.0342,"Overview":"DC Green Corps trains seasonal adult cohorts entry level workforce development in urban forestry, storm water mitigation, green infrastructure, urban agriculture & related fields.","Training.Credentials.Offered":"Self confidence and job readiness skills. Mentoring and resources for job placement.","Link":"https://washingtonparks.net/programs/green-corps/"},{"Program":"Detroit Conservation Corps","Org":"The Greening of Detroit","City":"Detroit","State":"MI","Lat":42.4263,"Lon":-83.1178,"Overview":"The Detroit Conservation Corps provides unemployed adult residents with valuable hands-on job training opportunities and certifications within the urban forestry and landscaping sectors.","Training.Credentials.Offered":"Certified Landscape Technician. Certified Tree Artisan.","Link":"https://www.greeningofdetroit.com/adult-training"},{"Program":"Duwamish Infrastructure Restoration Training (DIRT) Corps","Org":"Seattle Parks Foundation","City":"Seattle","State":"WA","Lat":47.6,"Lon":-122.3333,"Overview":"DIRT Corps focuses on creating green career pathways for people facing barriers within the existing routes to environmental work. Paid training is available for adult participants.\n","Training.Credentials.Offered":"Arboriculture and horticulture. Vegetation and stormwater management. Salmon recovery. Green infrastructure. Design/build/maintenance. General landscaping. Community environmental engagement.","Link":"https://www.thedirtcorps.com/education/"},{"Program":"Environmental Services Division","Org":"Urban Corps San Diego","City":"San Diego","State":"CA","Lat":32.756,"Lon":-117.2019,"Overview":"Urban Corps serves as a bridge to a better life for young adults ages 18-26. Corps members are able to experience and learn about San Diego’s natural environment, including identification of native flora and fauna, and how to remove invasive non-native plants.","Training.Credentials.Offered":"Brush management. Landscape maintenance. Tree Planting & Education. Design/Build Landscaping. Trail Building & Maintenance. Irrigation System Design & Installation. Crib Step Construction. Land Management. Fire Fuel Reduction/Fire Breaks. Non-Native Species Removal. Chipping.","Link":"https://www.urbancorpssd.org/environmental-services"},{"Program":"Environmental Services Program","Org":"San Gabriel Valley Conservation Corp","City":"El Monte","State":"CA","Lat":34.0896,"Lon":-118.0263,"Overview":"Geared toward youth ages 18-25, this program protects and maintains the urban environment throughout the San Gabriel Valley. ","Training.Credentials.Offered":"Youth learn about conservation and preservation, including restoration of watersheds, parks, open spaces, natural habitats and ecosystems.","Link":"http://www.sgvcorps.org/programs/conservation-work/"},{"Program":"ES Summer Youth Program","Org":"Koreatown Youth and Community Center","City":"Los Angeles","State":"CA","Lat":34.0611,"Lon":-118.3128,"Overview":"Established in 2012, this summer program serves 15- to 24-year olds in activities such as tree planting, tree maintenance, community engagement and outreach, event planning and preparation, graffiti removal and abatement, and street cleaning activities.","Training.Credentials.Offered":"Provide professional development days throughout the term that have included resumé-building workshops, tree biology training, and field trips.","Link":"https://www.kyccla.org/services/environmental-services/es-summer-youth-program/"},{"Program":"Forestry Trainee","Org":"Openlands","City":"Chicago","State":"IL","Lat":41.8912,"Lon":-87.5994,"Overview":"Since 2018, the Forestry Training Program has provided interested individuals paid, hands-on field experiences, trainings and professional development opportunities in arboriculture.","Training.Credentials.Offered":"Over eight months, trainees experience the full life cycle of an urban tree by selecting trees at the nursery, planting trees, conducting tree establishment maintenance (watering, mulching and pruning), and inventorying established trees. ","Link":"https://www.openlands.org/2019/12/26/planting-trees-growing-careers-recapping-the-2019-forestry-training-program/"},{"Program":"Garden Time-To-Work","Org":"Garden Time, Inc","City":"Providence","State":"RI","Lat":41.8472,"Lon":-71.3936,"Overview":"Garden Time provides prison-based educational programs that teach incarcerated men and women how to cultivate gardens and grow food for their own economic and personal well-being and self-reliance.","Training.Credentials.Offered":"Participants learn practical skills and knowledge relevant to the fields of agriculture, landscaping and horticulture, as well as critical 21st-century learning skills and soft skills necessary for any future employment.","Link":"http://www.gardentime.us/"},{"Program":"Greater Valley Conservation Corps","Org":"Greater Valley Conservation Corps/San Joaquin County Office of Education","City":"Stockton","State":"CA","Lat":37.9622,"Lon":-121.2626,"Overview":"This program serves young adults 18- to 25-years old with academic instruction, employment opportunities, green job training and life skills training.","Link":"http://www.greatervalleycc.org/"},{"Program":"Green Corps","Org":"Franklin Park Conservatory","City":"Columbus","State":"OH","Lat":39.9658,"Lon":-82.9521,"Overview":"The Green Corps Jobs Program provides horticulture and landscaping training to eligible adults ages 18–24 who are interested in obtaining a career in the green, environmental and agricultural industries. ","Training.Credentials.Offered":"Participants work side-by-side with employees at Franklin Park Conservatory and Botanical Gardens gaining skills in horticulture, landscape and garden maintenance and green practices. Concentrated classroom and hands-on training, including guest speakers and visits to local businesses, provide comprehensive preparation so participants may confidently enter the job market at the end of the 10-week, 320-hour training program.","Link":"https://www.fpconservatory.org/education-programs/outreach-programs/green-corps/"},{"Program":"Green Crew","Org":"Friends of the Urban Forest","City":"San Francisco","State":"CA","Lat":37.8021,"Lon":-122.4498,"Overview":"The Green Crew program consists of two to three young adults who have come to Friends of the Urban Forest through the Zuckerberg San Francisco General Hospital’s Wraparound Project, which helps young survivors of violence to change their lives. ","Training.Credentials.Offered":"Marketing support for community plantings; learn to plant and prune trees; lead volunteer groups in planting, pruning and sidewalk landscaping; collect and curate data on young trees planted by FUF; help advise property owners; and re-stake trees in need. Improve landscaping practices for application in local communities; improve basic job skills including timeliness, professionalism, customer service, resume preparation; provide ride-along trainings with local arborists, which provides introduction and exposure to professional practices.","Link":"https://www.fuf.net/programs-services/education/green-crew/"},{"Program":"Green ReEntry","Org":"Inner City Muslim Action Network","City":"Chicago","State":"IL","Lat":41.7802,"Lon":-87.6906,"Overview":"Green ReEntry provides transitional housing, life skills education, and sustainable construction training for returning citizens and high-risk youth.","Training.Credentials.Offered":"Paid opportunity for hands-on, vocational training with an integrative focus on personal, professional and leadership development.","Link":"https://www.imancentral.org/chicago/project-green-reentry/"},{"Program":"Green Streets Crew","Org":"NJ Tree Foundation","City":"Newark","State":"NJ","Lat":40.1362,"Lon":-74.3873,"Overview":"The NJ Tree Foundation partners with the New Jersey Parole Board on the Green Streets Crew project, which hires men for a tree planting crew, creating transitional jobs for individuals under parole supervision. Transitional jobs are time-limited jobs that combine real work, skill development, and support services to help participants overcome barriers to employment. Since spring 2006, this program has planted 16,630 trees and employed 106 parolees.","Training.Credentials.Offered":"High-quality tree-planting, landscaping, maintenance, and training services, including street/park tree planting and maintenance (small tree pruning, stake removal, mulching, & watering); rain garden installation and maintenance (rain garden design, excavation & installation, maintenance and weeding); and hands-on education workshops (State-approved Continuing Education Units (CEUs), \"Right Tree Right Place\" method, and pruning, mulching, & maintenance techniques).","Link":"https://www.facebook.com/pg/njtrees/about/?ref=page_internal"},{"Program":"Greencorps Chicago","Org":"Greencorps Chicago","City":"Chicago","State":"IL","Lat":41.8903,"Lon":-87.6969,"Overview":"Greencorps Chicago is a green-industry employment program with on-the-job training for individuals with barriers to employment. It promotes environmental stewardship and improves the quality of life in Chicago by establishing, maintaining and restoring natural and public spaces that are safe, healthy, and sustainable through hands-on involvement with program participants.","Training.Credentials.Offered":"Practical field experience and technical training in a variety of environmentally related jobs.","Link":"https://greencorpschicago.org/"},{"Program":"Greenskills Program","Org":"Urban Resource Initiative","City":"New Haven","State":"CT","Lat":41.3204,"Lon":-72.92,"Overview":"URI GreenSkills is a green jobs program that employs high school students and adults with employment barriers through the planting of trees. It connects people to their communities, their environment, and each other.","Training.Credentials.Offered":"Tree planting and maintenance; education on local ecology; serving as group leaders; collaboration with peers; improving New Haven’s street tree canopy. Learn skills such as leadership and multitasking, gain marketable job and mentoring skills, foster a sense of environmental stewardship, and make meaningful positive change in New Haven communities.","Link":"https://uri.yale.edu/programs/greenskills"},{"Program":"GYFTED Tree Care Management Training Program","Org":"Greening Youth Foundation","City":"Atlanta","State":"GA","Lat":33.7552,"Lon":-84.3833,"Overview":"The Greening Youth Foundation Trained Educated and Developed (GYFted) program is an intensive training program that has two tracts: (1) the standard tract prepares youth for a 1-year Urban Youth Corps experience; (2) the GYFted Tree Care tract prepares youth to enter directly into the tree care industry.","Training.Credentials.Offered":"Technical skills, including chainsaw operation, chipper operation, ground operation. Soft skills, such as professional development, financial literacy, health and nutrition, and character development. A regimen to ensure good physical health, which includes daily physical exercises and a healthy meal plan.","Link":"http://uyc.gyfoundation.org/overview/"},{"Program":"HOPE Program","Org":"Sustainable South Bronx","City":"New York","State":"NY","Lat":40.8212,"Lon":-73.8843,"Overview":"HOPE empowers New Yorkers to build sustainable futures through comprehensive training, jobs, advancement and lifelong career support.","Training.Credentials.Offered":"Comprehensive approach that provides training, adult basic education, industry certifications, work wellness services, internships and job placement with long-term support. ","Link":"http://www.thehopeprogram.org/"},{"Program":"Job Apprenticeship Program","Org":"Knox Hartford","City":"Hartford","State":"CT","Lat":41.7618,"Lon":-72.6962,"Overview":"KNOX provides green jobs training and career counseling to out-of-work residents in Hartford. Members lead horticultural service projects across the city; support community and corporate volunteer groups; maintain green spaces and KNOX’s community gardens; and plant trees to enhance Hartford’s urban forests.","Training.Credentials.Offered":"Members take part in horticultural training and life skills workshops before advancing to further educational and employment opportunities. Members earn a living stipend and receive school and job placement counseling for one year after completing their service.","Link":"https://www.knoxhartford.org/programs/workforce-development/"},{"Program":"Landforce Crew","Org":"Landforce","City":"Pittsburgh","State":"PA","Lat":40.4487,"Lon":-79.8941,"Overview":"Working closely with a coalition of public and private agencies as well as a network of greenspace and workforce development experts, Landforce recruits, trains, educates, employs and supports adults who have faced structural barriers to stable, family sustaining, employment based upon race or personal histories.","Training.Credentials.Offered":"Facilitates quality land stewardship services such as: invasive plant management removal, vacant lot stabilization, garden bed installation, wooden step installation, trail building, reforestation, garden maintenance, erosion control, tree care/maintenance, riparian zone management, and additional green infrastructure maintenance needs for a variety of land types throughout the city and county. Provides meaningful employment, coupled with transitional career coaching, using best practices and a trauma-informed approach.","Link":"https://www.landforcepgh.org/"},{"Program":"Landscape Training\nArborist Apprenticeship","Org":"City of Milwaukee","City":"Milwaukee","State":"WI","Lat":43.051,"Lon":-87.9589,"Overview":"The City of Milwaukee’s Urban Forestry Arborist Apprentice Program consists of 7,000 hours (approximately 3.5 years) and includes 6,560 hours of on-the-job learning and 440 hours of paid related instruction encompassing all aspects of tree care, from planting and pruning to managing diseases and insects. ","Training.Credentials.Offered":"This comprehensive program prepares Arborist Apprentices to become Urban Forestry Specialists (Journey Worker Arborists) working for the City of Milwaukee. Apprentices learn how to climb trees using rope, saddle, and other tree-climbing equipment. Work at heights of 60 feet or more while utilizing the proper safety equipment. Assess and perform pruning on young, juvenile, mature, and over-mature trees. Perform a climbing aerial rescue. Plan and set up tree rigging for topping, felling, and removing urban trees. Use a chainsaw safely, and perform field maintenance. Correctly tie various tree climbing and rigging knots. Plant, maintain, and remove trees, shrubs, and other landscape plants. Operate and drive vehicles such as an aerial lift and 2½-ton dump truck. Operate job-related power equipment and hand-held equipment. Perform field maintenance on some power equipment. Construct, repair, and maintain irrigation systems. Safely drive and operate snow plows and salt trucks on city streets. Accurately complete activity reports.","Link":"https://city.milwaukee.gov/ImageLibrary/User/jkamme/PastJobAnnouncements/UrbanForestryArboristApprentice.pdf"},{"Program":"Love & Faith Arborist Apprenticeship Program","Org":"Northcott Neighborhood House","City":"Milwaukee","State":"WI","Lat":43.0655,"Lon":-87.9112,"Overview":"Northcott Neighborhood House provides classroom and hands-on instructional activities for our Urban Arborist Pre-Apprenticeship Training Program.","Training.Credentials.Offered":"A paid pre-apprenticeship program. Successful trainees will acquire Industry Certifications.","Link":"https://northcotthouse.org/job-trainings"},{"Program":"Onondaga Earth Corps","Org":"Onondaga Earth Corps","City":"Syracuse","State":"NY","Lat":43.0404,"Lon":-76.1482,"Overview":"Empowers youth to be active participants in creating positive change for their communities and the environment. Bring youth to the forefront of creating livable, sustainable communities through service, social enterprise and outreach. Help youth understand the relationship between people and the urban ecosystem. Engage youth in hands-on community and environmental service learning projects. ","Training.Credentials.Offered":"Corps programs lead to positive impacts on participants’ employment and earnings, while teaching them valuable job readiness and technical skills for the future. Train youth for future jobs and careers in environmental fields. Empower youth by developing their leadership abilities that help them analyze situations, solve problems and implement strategies to improve their communities.","Link":"http://www.onondagaearthcorps.org/"},{"Program":"Our City Forest Americorps Service Program","Org":"Our City Forest","City":"San Jose","State":"CA","Lat":37.3662,"Lon":-121.8491,"Overview":"Our City Forest AmeriCorps service members are trained to be urban forestry & outreach specialists. They build capacity in the community by engaging volunteers and residents in cultivating plants at the community nursery, planting and caring for trees in neighborhoods, schools and parks, and fighting the drought through water conservation efforts. ","Training.Credentials.Offered":"Members are trained to be urban forestry & outreach specialists. They build capacity in the community by engaging volunteers and residents in cultivating plants at the community nursery, planting and caring for trees in neighborhoods, schools and parks, and fighting the drought through water conservation efforts. AmeriCorps members educate the community on Our City Forest’s best practices and help train local environmental stewards. AmeriCorps members make a positive impact on the people and communities we serve. You will also receive a Living Stipend during the term and an Education Award upon completion, which can be applied to student loans or for furthering your education. ","Link":"http://www.ourcityforest.org/americorps"},{"Program":"PowerCorps PHL","Org":"Power Corps PHL/ EducationWorks","City":"Philadelphia","State":"PA","Lat":39.9613,"Lon":-75.1536,"Overview":"PowerCorpsPHL is a cross-sector collaborative model that engages disconnected young adults and returning citizens to enter and succeed in career pathways by using service as the strategy. PowerCorpsPHL provides career-connected education and paid work experiences in collaboration with AmeriCorps and the city of Philadelphia, powered by EducationWorks.","Training.Credentials.Offered":"Working closely with Philadelphia Parks & Recreation, the Philadelphia Water Department, and partners in the public and private sector, PowerCorpsPHL builds opportunities for young people to create promising futures by tackling pressing environmental challenges and developing the skills required to secure meaningful work. The program aids with job recruitment and provides fellowships and post-secondary educational support.","Link":"http://powercorpsphl.org/"},{"Program":"Rocky Mountain Youth Corps","Org":"Rocky Mountain Youth Corps","City":"Albuquerque","State":"NM","Lat":40.4917,"Lon":-106.8511,"Overview":"Corpsmembers learn the skills they need to be successful in their personal and professional relationships. The life skills curriculum teaches the values of being personally accountable and working cooperatively within diverse groups. ","Training.Credentials.Offered":"Provide trainings in leadership, communication, diversity & inclusion, substance abuse prevention, financial management, work keys and job searches, post-secondary options, and public speaking and presentation skills. Additional training includes history of national service, sexual harassment in the workplace, conflict resolution, team building, effective communication, and job skills.","Link":"https://youthcorps.org/about/training-department/"},{"Program":"Roots to Re-entry","Org":"Pennsylvania Horticultural Society","City":"Philadelphia","State":"PA","Lat":39.956,"Lon":-75.1721,"Overview":"PHS’s workforce development program supports people returning to their communities upon release from the Philadelphia Department of Prisons. ","Training.Credentials.Offered":"The program offers paid training in horticulture, landscape maintenance, greenhouse operations, and carpentry and masonry. The training also includes job readiness, conflict resolution, health education, and occupational therapy. Upon graduating, PHS provides continued case management support and job placement with partnering employers.","Link":"https://phsonline.org/programs/workforce-development-programs"},{"Program":"Service Corps","Org":"Green City Force","City":"New York","State":"NY","Lat":40.6997,"Lon":-73.9471,"Overview":"The Service Corps is a structured, full-time experience. Service initiatives respond to needs in public housing communities, cultivating and distributing fresh produce, building sustainable green infrastructure, and reaching residents with sustainability programs. GCF AmeriCorps members serve four days a week in the field in service, and one day a week in classroom training.","Training.Credentials.Offered":"Classroom training includes eco-literacy and applied environmental education. Corps Members train for and take the GPro (Green Building Professional) certification administered by the U.S. Green Building Council. Trainings in agriculture, culinary skills and nutrition, electrical, plumbing, carpentry, pest management, recycling, compost processing, and hydroponics prepare Corps Members with technical skills for a range of sustainable career pathways.\nProfessional development workshops build job interview, networking, and resume writing skills. Corps Members are provided with social and emotional support through a combination of individual and group sessions facilitated by the GCF’s Youth Development Social Work team. Corps Members gain the opportunity to develop emotional processing, communication skills, advocacy skills, and other transferable life skills.Corps Members gain the opportunity to develop emotional processing, communication skills, advocacy skills, and other transferable life skills.Corps Members gain the opportunity to develop emotional processing, communication skills, advocacy skills, and other transferable life skills.","Link":"https://greencityforce.org/service-corps/"},{"Program":"Stormwater Management Training","Org":"CivicWorks","City":"Baltimore","State":"MD","Lat":39.3216,"Lon":-76.5852,"Overview":"Stormwater Management Training participants learn to safely install effective best practices that reduce and clean polluted stormwater runoff, improving the health of our Chesapeake Bay so that all Baltimore residents will be able to enjoy our waterways. Training participants work with companies in the region that perform stormwater installations, landscaping, and stream restoration.\n\nThis technician training is the first of its kind in the Mid-Atlantic region. Stormwater management is an industry primed for expansion and job creation. ","Training.Credentials.Offered":"Participants start training in a classroom and hands-on learning setting, earning industry recognized credentials, including the Clean Water Certificate. After successfully completing the classroom and hands-on components of the training program, participants have an opportunity to participate in paid on-the-job training. Graduates are placed into entry-level green careers with employers that offer a living wage and opportunities for advancement.","Link":"http://sustainablecareers.civicworks.com/for-applicants/stormwater-management-training/"},{"Program":"Sustainable Youth Internship","Org":"Earth Team","City":"Richmond","State":"CA","Lat":37.914,"Lon":-122.3334,"Overview":"The Sustainable Youth Program takes a long-term approach to environmental education by working with individual core schools to offer a variety of projects–from short-term class visits to year long after school internships–all with a multi-year approach that caters to the unique needs of students and their respective schools. Projects focus on waste, watersheds, litter and urban forestry. ","Training.Credentials.Offered":"The Restoration Action Project is a curriculum-connected project designed to educate middle and high school classes in local restoration projects. The program consists of three or more class visits and two or more field days, and is often used to fulfill service-learning project requirements and to give classes opportunities to interact with their local parks and creeks. Restoration ecology education topics range from water quality assessment, erosion control, invasive species control methods, and plant propagation, to wetlands functions/ hydrology and redwood reforestation. ","Link":"https://www.earthteam.net/our-projects/"},{"Program":"Teen Urban Foresters","Org":"Canopy","City":"Palo Alto","State":"CA","Lat":37.4321,"Lon":-122.1033,"Overview":"Canopy’s Teen Urban Foresters (TUFs) serve as stewards and leaders in local urban greening. Students from high schools in East Palo Alto work part-time during the school year and summer, and participate in every facet of Canopy’s tree planting and tree care programs—planting, pruning, and caring for trees; leading volunteer groups; assisting with events; and more.","Training.Credentials.Offered":"Beyond learning marketable skills and gaining job experience, the TUFs work together to improve their neighborhoods in tangible ways. They help build local pride and contribute to the economic and civic renewal of their community by bringing the life-giving benefits to local schools, parks, and neighborhoods.","Link":"https://canopy.org/our-work/education/teen-urban-foresters/"},{"Program":"Tree Corps CREW","Org":"The Holden Arboretum","City":"Cleveland","State":"OH","Lat":41.6115,"Lon":-81.3011,"Overview":"Tree Corps is an arboriculture workforce development program designed to provide valuable training and entry-level job placement for Cleveland residents in the tree care industry. Funded with a generous grant from the Cleveland Foundation, Tree Corps works to support Cleveland’s urban tree canopy on public and private property while increasing Cleveland’s workforce capacity.","Training.Credentials.Offered":"The Tree Corps CREW (Cleveland-Region Experiential Work) Program offers a paid job experience with exposure to and training in tree-care and related (horticulture, natural resources) careers for young, early-career Cleveland-area residents. The 8-member Tree Corps Crew spends 6 weeks learning key arboriculture skills, engaging in field experiences, and working on tree and land care related to the Cleveland Tree Plan. The program concludes with a capstone project and opportunities to shadow green career professionals. ","Link":"https://www.holdenarb.org/tree-corps/"},{"Program":"Urban Conservation Corps","Org":"Sourthern California Mountains Foundation","City":"San Bernadino","State":"CA","Lat":34.1403,"Lon":-117.3132,"Overview":"Young adults from San Bernardino and Riverside counties ages 18-25 can join this program to get paid work experience and earn their high school diploma through our onsite John Muir Charter School. The Southern California Mountains Foundation Urban Conservation Corps offers young men and women the chance to better their lives, serving in the Southern California Mountains and become employable citizens through hard work in environmental conservation. ","Training.Credentials.Offered":"Recycling Services, Forest Restoration, Wildfire Fuels Reduction, Park Maintenance, Interpretive Programs/Community Outreach,  Landscape & Maintenance, GPS Monitoring, Neighborhood Revitalization, Graffiti Removal, Trail Building","Link":"https://mountainsfoundation.org/programs/urban-conservation-corps"},{"Program":"Urban Roots Apprenticeship","Org":"Baltimore Tree Trust","City":"Baltimore","State":"MD","Lat":39.3187,"Lon":-76.6209,"Overview":"The Urban Roots Apprenticeship recruits, trains, mentors and connects Baltimoreans to successful careers in the tree care and landscaping industries. The program works to lessen the barriers between green jobs and those interested in them. ","Training.Credentials.Offered":"Our curriculum includes on-the-job training and instruction in the following areas: Plant & Tree Biology; Ecosystems, Sustainability and Reducing waste; Urban Forestry; Tree Planting, Pruning and Maintenance; Pest Management; Residential and Commercial landscaping; Landscape Design","Link":"http://www.baltimoretreetrust.org/community/workforce-development/"},{"Program":"Verde Landscape","Org":"Verde ","City":"Portland","State":"OR","Lat":45.568,"Lon":-122.5912,"Overview":"Verde Landscape hires and trains crew members from Portland's Cully neighborhood and other low-income, people of color communities to offer higher-value, higher-skilled landscape services in and outside Cully. The organization's business model and comprehensive training program make a deep investment in people of color and low-income communities.  ","Training.Credentials.Offered":"Regular crew members earn a competitive wage, receive Verde‐paid medical and dental insurance, and participate in on‐the‐job training and classroom training in: Stormwater Management; Habitat Restoration; Sustainable Landscape Installation; Landscape Maintenance. ","Link":"http://www.verdenw.org/"},{"Program":"Work2Live WELL","Org":"Department of Natural Resources","City":"Baltimore","State":"MD","Lat":39.2966,"Lon":-76.7893,"Overview":"Work2Live WELL is a personal and professional development program for adults with a fast-track entry into the important career world of the environment and natural resources that combines technical skills and training to ensure a solid foundation for employment and success.","Training.Credentials.Offered":"The program is designed to offer exposure, opportunity and training in several emerging fields and sectors. Detailed field training plus classroom sessions, one-on-one mentoring and assistance is followed by opportunities to interview for employment with a private or public employer. The Land & Environment track includes skills training relating to forestry/tree care, environmental restoration, and land management.","Link":"http://dnr.maryland.gov/ccs/Pages/work-to-live-well/Work-to-Live-Well.aspx"},{"Program":"Young Adult Corps","Org":"Los Angeles Conservation Corps","City":"Los Angeles","State":"CA","Lat":34.0779,"Lon":-118.2352,"Overview":"The LA Corps’ hallmark youth and workforce development and transitional jobs program, the Young Adult Corps, offers environmentally focused work projects to predominately under-served youth, often from under-resourced neighborhoods, between the ages of 18-24.","Training.Credentials.Offered":"Corpsmembers receive specialized and robust opportunities to train for and gain work experience in fields with high-demand jobs and an environmental focus. They connect to the community through environmental stewardship and develop expertise that leads them toward pathways to high-demand, environmentally focused employment opportunities.","Link":"https://www.lacorps.org/young-adult-corps/"},{"Program":"Youth Construction and Conservation Corps","Org":"LA Green Corps","City":"New Orleans","State":"LA","Lat":29.9697,"Lon":-90.0796,"Overview":"The LAGC’s YCCC is a 14 week construction and conservation training program that provides nationally recognized certification training, soft skills training, and performance incentives to youth aged 18-25 in the Greater New Orleans Area. Through a partnership with the SBP, Inc, formerly the St. Bernard Project, local youth rehabilitate blighted homes in the Greater New Orleans Area while incorporating building science best practices into their work.","Training.Credentials.Offered":"Students receive the opportunity to concentrate on math, reading and language skills from an academic instructor. Financial proficiency, employability skills, resume writing, resiliency and tool training workshops are also included in our program. LAGC provides training stipends as well as transportation assistance. The YCCC program offers four classes a year free for those who qualify.","Link":"https://lagreencorps.org/training"},{"Program":"Youth Environmental Stewardship Program","Org":"North East Trees","City":"Los Angeles","State":"CA","Lat":34.0863,"Lon":-118.2249,"Overview":"The Youth Environmental Stewardship Program is a vocational training program that teaches at- risk young adults (ages 16-24) marketable skills in urban forestry and sustainable landscaping in Northeast Los Angeles. ","Training.Credentials.Offered":"Train at-risk youth and young adults in environmental disciplines that lead to permanent employment in the green industry. Provide education in the areas of landscape design, arboriculture, horticulture, restoration ecology, hydrology and urban forestry. Help build individual character while developing a community-based work force. Encourage participants to pursue higher education in an environmental discipline. Provide job search training and assistance for graduates to find employment in the green industry.","Link":"http://www.northeasttrees.org/programs/youth-stewardship/"},{"Program":"Youth Green Corps","Org":"City of Seattle Dept of Parks and Rec with Seattle Trail Alliance","City":"Seattle","State":"WA","Lat":47.681,"Lon":-122.323,"Overview":"The Youth Green Corps (YGC) is a partnership conceived by Seattle Parks and Recreation and implemented with The Seattle Trail Alliance that educates and trains young adults (18-24) through a mix of classroom experiences and outdoor forestry restoration.  It is a 4-Month program that consists of up to 13 Corps Members.","Training.Credentials.Offered":"YGC members work on Forest Restoration and Trail work in Seattle Parks for educational and career training.  They learn site management, restoration skills and management, tool safety, native plant species, invasive plant identification, and environmental stewardship in Seattle Parks.  ","Link":"https://www.seattle.gov/parks/volunteer/youth-green-corps"},{"Program":"Youth Tree Team","Org":"Trees Atlanta","City":"Atlanta","State":"GA","Lat":33.7488,"Lon":-84.3568,"Overview":"The Youth Tree Team (YTT) is a summer employment opportunity that gives high school students exposure to forestry, landscape design, horticulture, and arboriculture.","Training.Credentials.Offered":"The Youth Tree Team participates in weeding, mulching, pruning, and planting projects along the Atlanta BeltLine Arboretum and in neighborhoods. Included in the program are leadership and team-building activities, job skills training, personal financial literacy workshops, and networking opportunities with green collar professionals.","Link":"https://www.treesatlanta.org/programs/youth-tree-team/"},{"Program":"Youth Tree Team","Org":"Keep Indianapolis Beautiful","City":"Indianapolis","State":"IN","Lat":39.758,"Lon":-86.1395,"Overview":"The Youth Tree Team is a seven-week summer job program for teens and young adults that improves the community through tree care and work readiness training.","Training.Credentials.Offered":"Job Skills Certificate offered to YTT members based on teamwork, respectful behavior, accountability, active engagement, and communication. ","Link":"https://www.kibi.org/youth-tree-team"},{"Program":"Tree Trust YouthBuild","Org":"Tree Trust","City":"St. Paul","State":"MN","Lat":44.9733,"Lon":-93.1575,"Overview":"Tree Trust YouthBuild, a pre-apprenticeship program, offers the unique opportunity to gain hands-on training and earn a paycheck, all while working towards earning a high school diploma for young people, ages 16-21.","Training.Credentials.Offered":"Develop valuable career and leadership skills while helping your community through home construction and tree care. Earn while you learn; hands-on training; earn industry-recognized certifications from Home Builders Institute and Tree Care Industry Association; develop leadership skills; and gain long-term support.","Link":"https://treetrust.org/programs/jobprep/youthbuild/"}]
